Revit 2025 API
ReferenceBaseOnHostType Enumeration
 This enumeration is used to classify the Reference Base on Host type .
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ReferenceBaseOnHostType
Public Enumeration ReferenceBaseOnHostType
public enum class ReferenceBaseOnHostType
type ReferenceBaseOnHostType
Members
Member name | Value | Description
PrimaryEnd | 0
SecondaryEnd | 1
Midpoint | 2
See Also
Reference
Autodesk.Revit.DB Namespace